INSERT INTO books (title, author, language, publication_year, genre, description, isbn, page_count, rating, is_new, image_path, price, quantity)
VALUES
('Убийство в Восточном экспрессе', 'Агата Кристи', 'Русский', 2020, 'Детектив', 'Знаменитый детектив Эркюль Пуаро расследует убийство', '978-5-699-56789-0', 256, 9, FALSE, '/images/MurderOnTheOrientExpress.jpg', 450.00, 1),
('1984', 'Джордж Оруэлл', 'Английский', 2019, 'Художественная литература', 'Антиутопия о тоталитарном обществе', '978-0-452-28423-4', 328, 10, FALSE, '/images/1984.jpg', 600.00, 7),
('Гарри Поттер и философский камень', 'Дж.К. Роулинг', 'Русский', 2021, 'Фэнтези', 'Первая книга о юном волшебнике', '978-5-389-07435-4', 400, 9, TRUE, '/images/HarryPotterAndThePhilosophersStone.jpg', 850.00, 0),
('Clean Code', 'Роберт Мартин', 'Английский', 2022, 'Программирование', 'Советы по написанию чистого кода', '978-0-13-235088-4', 464, 9, TRUE, '/images/CleanCode.jpg', 1500.00, 2),
('Война и мир', 'Лев Толстой', 'Русский', 2020, 'Классика', 'Роман-эпопея о войне 1812 года', '978-5-17-067363-0', 1225, 10, FALSE, '/images/WarAndPeace.jpg', 700.00, 5),
('Три товарища', 'Эрих Мария Ремарк', 'Русский', 1936, 'Роман', 'История дружбы и любви в послевоенной Германии', '978-5-17-090633-5', 384, 9, FALSE, '/images/ThreeComrades.jpg', 500.00, 7),
('451° по Фаренгейту', 'Рэй Брэдбери', 'Русский', 1953, 'Антиутопия', 'Мир, где книги находятся под запретом', '978-5-17-090634-2', 256, 9, TRUE, '/images/Fahrenheit451.jpg', 600.00, 10),
('Портрет Дориана Грея', 'Оскар Уайльд', 'Русский', 1890, 'Классика', 'Роман о красоте, разврате и вечной молодости', '978-5-17-090636-6', 320, 9, FALSE, '/images/DorianGray.jpg', 450.00, 6),
('Цветы для Элджернона', 'Дэниел Киз', 'Русский', 1966, 'Научная фантастика', 'История человека, ставшего гением в результате эксперимента', '978-5-17-090639-7', 320, 9.4, FALSE, '/images/FowersFAlgernon.jpg', 550.00, 3),
('Дюна', 'Фрэнк Герберт', 'Русский', 1965, 'Научная фантастика', 'Эпическая сага о пустынной планете и её ресурсах', '978-5-17-090640-3', 704, 9, FALSE, '/images/Dune.jpg', 850.00, 11),
('Грозовой перевал', 'Эмили Бронте', 'Русский', 1847, 'Классика', 'Мрачная история любви и мести на вересковых пустошах', '978-5-17-090643-4', 352, 9, FALSE, '/images/WutheringHeights.jpg', 450.00, 5),
('Марсианин', 'Энди Вейер', 'Русский', 2011, 'Научная фантастика', 'История астронавта, оставшегося в одиночестве на Марсе', '978-5-17-090644-1', 416, 9, TRUE, '/images/Martian.jpeg', 700.00, 14);

